package com.example.weather.model

data class City(val name: String, val lat: Double, val lon: Double)

val cityList = listOf(
    City("台北", 25.03746, 121.564558),
    City("清邁", 18.792453758539626, 98.98686053387648),
    City("倫敦", 51.5074, -0.1278),
    City("巴格達", 33.318257498914086, 44.35624559253614),
    City("薩武科斯基", 67.39741749487038, 28.204480718970444)
)

val taiwanCities = listOf(
    City("台北市", 25.0330, 121.5654),
    City("新北市", 25.0169, 121.4628),
    City("基隆市", 25.1309, 121.7390),
    City("桃園市", 24.9937, 121.3000),
    City("新竹市", 24.8039, 120.9647),
    City("新竹縣", 24.8385, 121.0031),
    City("苗栗縣", 24.5602, 120.8214),
    City("台中市", 24.1477, 120.6736),
    City("彰化縣", 24.0685, 120.5575),
    City("南投縣", 23.8388, 120.9876),
    City("雲林縣", 23.7092, 120.4313),
    City("嘉義市", 23.4801, 120.4491),
    City("嘉義縣", 23.4519, 120.2550),
    City("台南市", 22.9999, 120.2270),
    City("高雄市", 22.6273, 120.3014),
    City("屏東縣", 22.5510, 120.5487),
    City("宜蘭縣", 24.7021, 121.7378),
    City("花蓮縣", 23.9872, 121.6015),
    City("台東縣", 22.7566, 121.1444),
    City("澎湖縣", 23.5711, 119.5797),
    City("金門縣", 24.4367, 118.3186),
    City("連江縣", 26.1608, 119.9517)
)
